{
  "projects": [
    {
      "id": 1,
      "title": "Design Draft Generator",
      "description": "Aveo AI Design Draft generator is a project created for Aveo Web & Marketing. Which create AI generated design drafts.",
      "long_description": "Aveo AI Design Draft generator is a project that I launched for <strong style=\"color: #facc15\">Aveo.dk</strong>, which is a subbrand of <strong style=\"color: #facc15\">Auxo</strong>, where I currently work.\nThe project is a tool that generates design drafts for websites, based on the users input. The main purpose of the generator is to give the user a visual representation of how their website could look, but also <strong style=\"color: #facc15\">collect leads</strong> for the <strong style=\"color: #facc15\">sales team</strong> to follow up on.\n\nThe generator uses the <strong style=\"color: #facc15\">OpenAI API</strong> to utilize their <strong style=\"color: #facc15\">LLM model</strong>, which is prompted with the users input and some design theory. Then the generator creates a response which includes design decisions, which then is handled by the plugin and used to generate the design draft, based on a lot of different design models and templates, created by me. The design draft is generated in plain HTML and CSS, which allows for the creation of interactive elements, using <strong style=\"color: #facc15\">JavaScript</strong>.\n\nThe generator is also utilizing a <strong style=\"color: #facc15\">CVR API</strong>, to collect data about the users company, which is then used to create a more <strong style=\"color: #facc15\">personalized design</strong> draft. And gives the sales team a better understanding of the users needs.\n\nUnfortunately the project is not open source, but you can see a demo of the generator in action, in the <strong style=\"color: #facc15\">video below</strong>.",
      "github": "",
      "website": "https://aveo.dk/gratis-hjemmeside-udkast/",
      "card_image": "aveo-adg-form.webp",
      "image_2": "aveo-adg-draft-1.webp",
      "image_3": "aveo-adg-draft-2.webp",
      "techstack": ["PHP", "JavaScript", "Wordpress"],
      "techstack_description": [
        "PHP is the main language used for the <strong style=\"color: #facc15\">backend</strong> of the project, where it handles the <strong style=\"color: #facc15\">API requests</strong> and the <strong style=\"color: #facc15\">data handling</strong>, aswell as the dynamic content on the design draft, based on the response from the OpenAI API.",

        "JavaScript powers the project's frontend, handling user input, form validation, and <strong style=\"color: #facc15\">enhancing interactivity</strong>. It brings the design draft to life, allowing users to engage dynamically and gain a more immersive preview of how the final website could look and function in <strong style=\"color: #facc15\">real time</strong>.",

        "WordPress powers the Design Draft Generator, ensuring seamless integration with the Aveo.dk website. Developed as a <strong style=\"color: #facc15\">dedicated plugin</strong>, it simplifies <strong style=\"color: #facc15\">version management</strong>, deployment, and maintenance, allowing me and the development team to ensure <strong style=\"color: #facc15\">continuous improvements</strong> and optimal performance."
      ],
      "techstack_icons": ["php.svg", "js.svg", "wp.svg"],
      "video": "https://www.youtube.com/embed/0cnztwSfGwA",
      "thumbnail": "aveo-adg-thumbnail.webp"
    },
    {
      "id": 2,
      "title": "ResBook",
      "description": "ResBook is an online booking platform, created as a final project during the 5th semester at Business Academy Aarhus.",
      "long_description": "ResBook is a restaurant <strong style=\"color: #facc15\">booking system</strong> developed by my team and me as our final project during the 5th semester at Business Academy Aarhus. It enables users to easily book tables at restaurants while providing restaurant owners with an efficient booking management system.\n\n<strong>Key Features & Technologies:</strong>\n\n<strong>Advanced Authentication:</strong> A key feature of ResBook is its custom-built <strong style=\"color: #facc15\">authentication system</strong>, leveraging <strong style=\"color: #facc15\">session tokens</strong> and <strong style=\"color: #facc15\">Next.js middleware</strong> to ensure a secure and scalable authentication flow. <strong style=\"color: #facc15\">Watch the video</strong> below to learn more about our implementation.\n\n<strong>Dual Frontends for Seamless Experience:</strong> The system includes two <strong style=\"color: #facc15\">dedicated frontends</strong>—one for users, built with <strong style=\"color: #facc15\">Next.js</strong> for a smooth booking experience, and one for restaurants, developed in <strong style=\"color: #facc15\">Remix</strong> to provide an intuitive booking management interface.\n\n<strong>Robust Backend & Deployment:</strong> The <strong style=\"color: #facc15\">dedicated backend</strong> is developed using <strong style=\"color: #facc15\">PHP</strong> and powered by a <strong style=\"color: #facc15\">MySQL</strong> database for efficient data handling. The frontends are deployed on Vercel, while the backend runs on a PHP server provided by Simply, to ensure reliability and performance.",
      "github": "https://github.com/eaaa-dob-wu-e24a/RESBOOK",
      "website": "https://resbook.vercel.app/",
      "card_image": "resbook-iphone.webp",
      "image_2": "resbook-booking.webp",
      "image_3": "resbook-card-image.webp",
      "techstack": ["Next.js", "PHP", "Remix", "GitHub Projects / Git"],
      "techstack_description": [
        "Used to build the user-facing frontend of ResBook, ensuring a fast and smooth booking experience. It was chosen for its <strong style=\"color: #facc15\">server-side rendering (SSR)</strong> capabilities, API routes, and <strong style=\"color: #facc15\">middleware</strong>, which played a key role in implementing a secure authentication system.",

        "Used for the dedicated backend, handling <strong style=\"color: #facc15\">API requests</strong> and <strong style=\"color: #facc15\">database interactions</strong>. It provides a stable and efficient environment for managing restaurant bookings and user data while integrating seamlessly with the <strong style=\"color: #facc15\">MySQL</strong> database. The dedicated backend was build so it could be easily scaled and used by multiple frontends.",

        "Used to build the restaurant-facing frontend, offering an optimized and <strong style=\"color: #facc15\">interactive dashboard</strong> for managing bookings efficiently. The project requirements specified two separate frontends using <strong style=\"color: #facc15\">different frameworks</strong>, leading us to choose Remix for the second frontend.",

        "Used to organize and manage the <strong style=\"color: #facc15\">development process</strong>, ensuring smooth collaboration within the team. <strong style=\"color: #facc15\">Feature branches</strong> and <strong style=\"color: #facc15\">pull requests</strong> were utilized to maintain code quality and <strong style=\"color: #facc15\">streamline</strong> the workflow. Alongside GitHub Projects, we used <strong style=\"color: #facc15\">Git</strong> for version control."
      ],
      "techstack_icons": ["php.svg", "next.svg", "remix.svg", "git.svg"],
      "video": "https://www.youtube.com/embed/b1jvUvpvDiE",
      "thumbnail": "resbook-thumbnail.webp"
    }
  ]
}
